app/Controllers/Form_bantu.php

	function rinci($nmtbl, $rjk)
	{
		$uslvl = desme(session(encme("UserLvl")));
		$usid = desme(session(encme("UserID")));
		$whr = [];
		$fldtbl = json_decode($this->db->table('master_tbl')->where('nama_tbl', $nmtbl)->get()->getRow()->tabel);
---
SELECT *
FROM `master_tbl`
WHERE `nama_tbl` = 'tbl_subk'

						} else
						if ($v->edt == '7') {
							// $rcreftbl=$this->db->field_data($v->ref->tblr);
							$rcreftbl = json_decode($this->db->table("master_tbl")->where(["nama_tbl" => $v->ref->tblr])->get()->getRow()->tabel);
---
SELECT *
FROM `master_tbl`
WHERE `nama_tbl` = 'tbl_kriteria'

	function loadalt($rjk)
	{
		$alt = $this->db->table("tbl_alternatif")->get()->getResult();
		$tot = [];
		$prsn = floor(100 / (count($alt) + 1));
		echo "<table class='table table-bordered table-striped'><tr><th>Alternatif</th>";
		foreach ($alt as $r) {
			echo "<th width='$prsn%'>" . $r->nama . "</th>";
			$tot[$r->id] = 0;
		};
		echo "</tr>";
		foreach ($alt as $r) {
			echo "<tr><td>" . $r->nama . "</td>";
			foreach ($alt as $r2) {
				$dt = $this->db->table("tbl_bobotalt")->where(["kriteria" => $rjk, "alternatif1" => $r->id, "alternatif2" => $r2->id])->get()->getRow();
---
SELECT *
FROM `tbl_alternatif`
SELECT *
FROM `tbl_bobotalt`
WHERE `kriteria` = '2'
AND `alternatif1` = '100043'
AND `alternatif2` = '100043'

	function loadkrta()
{
    $krta = $this->db->table("tbl_kriteria")->where('aktif', '1')->get()->getResult();
    $tot = [];
    $prsn = floor(100 / (count($krta) + 1));
    echo "<div><center><h4>Matriks Perbandingan Kriteria</h4></center></div><table class='table table-bordered table-striped'><tr><th>Kriteria</th>";

    // Create a counter variable to index the criteria starting from 1
    $index = 1;
    foreach ($krta as $r) {
        echo "<th width='$prsn%'>" . $r->nama_kriteria . " (K" . $index . ")</th>";
        $tot[$r->id_kriteria] = 0;
        $index++; // Increment the counter
    }
    echo "</tr>";

    $index = 1; // Reset the counter for the row headers
    foreach ($krta as $r) {
        echo "<tr><td>" . $r->nama_kriteria . " (K" . $index . ")</td>";
        foreach ($krta as $r2) {
            $dt = $this->db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();
---
SELECT *
FROM `tbl_kriteria`
WHERE `aktif` = '1'
SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'

	function konsistensi($tp = null)
{
    $krta = $this->db->table("tbl_kriteria")->where('aktif', '1')->get()->getResult();
    $tot = [];
    $prts = [];
    $jml = [];
    $ri = [0.00, 0.00, 0.58, 0.90, 1.12, 1.24, 1.32, 1.41, 1.45, 1.49, 1.51, 1.48, 1.56, 1.57, 1.59];

    // Menyiapkan nomor urut manual untuk menampilkan ID kriteria dari K1, K2, ...
    $counter = 1;
    $kriteria_map = []; // Untuk mapping ID kriteria ke nomor K

    foreach ($krta as $r) {
        $tot[$r->id_kriteria] = 0;
        $kriteria_map[$r->id_kriteria] = 'K' . $counter++; // Mapping ID kriteria ke nomor K
    };
    foreach ($krta as $r) {
        foreach ($krta as $r2) {
            $dt = $this->db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();
---
SELECT *
FROM `tbl_kriteria`
WHERE `aktif` = '1'
SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'

        $n = 0;
        foreach ($krta as $r2) {
            $n++;
            $dt = $this->db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();
---
SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'

    foreach ($krta as $r) {
        $jum = 0;
        foreach ($krta as $r2) {
            $dt = $this->db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();
---
SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'