app/Controllers/Hal.php

	function mt($nm = null, $flt = null)
	{
		if ($nm != null) {
			$jdlhal = "Data " . ucwords((substr(desme($nm), 4)));
			if (desme($nm) == "tbl_submas" and $flt != null) {
				$dtbl = $this->db->table(desme($nm))->where("id", desme($flt))->get()->getResult();
			} else if (desme($nm) == "tbl_subk" and $flt != null) {
				$dtbl = $this->db->table(desme($nm))->where("kriteria", desme($flt))->get()->getResult();
			} else {
				$dtbl = $this->db->table(desme($nm))->get()->getResult();
			}

			$dt = [
				"jdlapp" => "SPK Metode AHP",
				"jdlhal" => $jdlhal,
				'uslvl' => desme(session(encme("UserLvl"))),
				'usid' => desme(session(encme("UserID"))),
				'usname' => desme(session(encme("UserName"))),
				'usnama' => desme(session(encme("Nama"))),
				'set' => $this->set,
				"bcb" => [["url" => base_url(), "jdl" => "Home"], ["url" => "", "jdl" => $jdlhal]],
				"tabel" => $this->db->table("master_tbl")->where("nama_tbl", desme($nm))->get()->getRow(),
				"dtbl" => $dtbl
			];
---
SELECT *
FROM `tbl_kriteria`
SELECT *
FROM `master_tbl`
WHERE `nama_tbl` = 'tbl_subk'

	function submas($flt = null)
	{
		$dt = array(
			"jdlapp" => "SPK Metode AHP",
			"jdlhal" => "Rincian Data Alternatif",
			'uslvl' => desme(session(encme("UserLvl"))),
			'usid' => desme(session(encme("UserID"))),
			'usname' => desme(session(encme("UserName"))),
			'usnama' => desme(session(encme("Nama"))),
			'set' => $this->set,
			'tblk' => $this->db->table("tbl_kriteria")->where('aktif', 1)->get()->getResult(),
---
SELECT *
FROM `tbl_kriteria`
WHERE `aktif` = '1'

	function hitung()
	{
		$dt = array(
			"jdlapp" => "SPK Metode AHP",
			"jdlhal" => "Perhitungan Metode AHP",
			'uslvl' => desme(session(encme("UserLvl"))),
			'usid' => desme(session(encme("UserID"))),
			'usname' => desme(session(encme("UserName"))),
			'usnama' => desme(session(encme("Nama"))),
			"bcb" => array(array("url" => base_url(), "jdl" => "Home"), array("url" => "", "jdl" => "Perhitungan Metode AHP")),
			"krta" => $this->db->table("tbl_kriteria")->where('aktif', '1')->get()->getResult(),
			'alt' => $this->db->table('tbl_alternatif')->get()->getResult(),
			'set' => $this->set,
			'dhsl' => $this->db->table('tbl_hasil')->orderBy('nomor desc')->get()->getRow(),
---
SELECT *
FROM `tbl_kriteria`
WHERE `aktif` = '1'
SELECT *
FROM `tbl_alternatif`
SELECT *
FROM `tbl_hasil`
ORDER BY `nomor` desc