app/Views/hitung.php

SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'
---
			echo "<tr><td>" . $r->nama_kriteria . " (K" . $counter . ")</td>"; // Menggunakan counter untuk penomoran
			$counter++;
			foreach ($krta as $r2) {
				$dt = $db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();

SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'
---

			foreach ($krta as $r2) {
				$n++;
				$dt = $db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();

SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'
---
			$counter++;

			foreach ($krta as $r2) {
				$dt = $db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();

SELECT *
FROM `tbl_bobotk`
WHERE `kriteria1` = '1'
AND `kriteria2` = '1'
---

			$jum = 0;
			foreach ($krta as $r2) {
				$dt = $db->table("tbl_bobotk")->where(["kriteria1" => $r->id_kriteria, "kriteria2" => $r2->id_kriteria])->get()->getRow();