app/Views/tabel.php

									} else
							if ($v->edt == '7') {
										//$rcreftbl=$this->db->field_data($v->ref->tblr);
										$rcreftbl = json_decode($db->table("master_tbl")->where("nama_tbl", $v->ref->tblr)->get()->getRow()->tabel);
---
SELECT *
FROM `master_tbl`
WHERE `nama_tbl` = 'tbl_kriteria'